import random

emoji_dict = {
    "залив": ["🌊", "🏄", "🏖", "🏝", "🏝", "🌴", "🐠"],
    "cпектакль": ["👹", "🎃", "😺", "🎭", "🎭", "🤹", "🎠"],
    "концерт": ["🎸", "🎼", "🎧", "🎶", "🎵", "🎹"],
    "космос": ["🪐", "🚀", "🛰", "🌠", "🌌"],
    "музыка": ["🎼", "🎧", "🦁", "🎶", "🎵", "🎹", "🎺", "🎻"],
    "кино": ["🎬", "🎥", "🎞"],
    "фото": ["📷", "📸", "🏙", "🌍"],
    "стрит": ["🌆", "🏙️", "🌉", "🌃", "🚅"],
    "вечер": ["🎭", "🎤", "🌒", "🌆", "🎩"],
    "лекция": ["🐢", "🐠", "🦓", "🐭", "🎤", "🦊"],
    "выставк": ["🦄", "🌳", "🎨", "🌅"],
    "другое": [
        "🦆",
        "🦋",
        "🦕",
        "🐙",
        "🦓",
        "🦍",
        "🐋",
        "🦀",
        "🦐",
        "🦂",
        "🐍",
        "🦖",
        "🐢",
        "🦜",
        "🐼",
        "🦔",
        "🐿",
        "🐈",
        "🐩",
    ],
}


def add_emoji(title):
    emoji = None

    for word in list(emoji_dict.keys()):
        if title.lower().find(word) != -1:
            emoji = random.choice(emoji_dict[word])
            break
    if emoji is None:
        emoji = random.choice(emoji_dict["другое"])

    return f"{emoji} {title}"
